###################################################################

# Created by write_sdc on Sat Jun 11 19:04:25 2022

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports mem_read_D]
set_load -pin_load 1 [get_ports mem_write_D]
set_load -pin_load 1 [get_ports {mem_addr_D[31]}]
set_load -pin_load 1 [get_ports {mem_addr_D[30]}]
set_load -pin_load 1 [get_ports {mem_addr_D[29]}]
set_load -pin_load 1 [get_ports {mem_addr_D[28]}]
set_load -pin_load 1 [get_ports {mem_addr_D[27]}]
set_load -pin_load 1 [get_ports {mem_addr_D[26]}]
set_load -pin_load 1 [get_ports {mem_addr_D[25]}]
set_load -pin_load 1 [get_ports {mem_addr_D[24]}]
set_load -pin_load 1 [get_ports {mem_addr_D[23]}]
set_load -pin_load 1 [get_ports {mem_addr_D[22]}]
set_load -pin_load 1 [get_ports {mem_addr_D[21]}]
set_load -pin_load 1 [get_ports {mem_addr_D[20]}]
set_load -pin_load 1 [get_ports {mem_addr_D[19]}]
set_load -pin_load 1 [get_ports {mem_addr_D[18]}]
set_load -pin_load 1 [get_ports {mem_addr_D[17]}]
set_load -pin_load 1 [get_ports {mem_addr_D[16]}]
set_load -pin_load 1 [get_ports {mem_addr_D[15]}]
set_load -pin_load 1 [get_ports {mem_addr_D[14]}]
set_load -pin_load 1 [get_ports {mem_addr_D[13]}]
set_load -pin_load 1 [get_ports {mem_addr_D[12]}]
set_load -pin_load 1 [get_ports {mem_addr_D[11]}]
set_load -pin_load 1 [get_ports {mem_addr_D[10]}]
set_load -pin_load 1 [get_ports {mem_addr_D[9]}]
set_load -pin_load 1 [get_ports {mem_addr_D[8]}]
set_load -pin_load 1 [get_ports {mem_addr_D[7]}]
set_load -pin_load 1 [get_ports {mem_addr_D[6]}]
set_load -pin_load 1 [get_ports {mem_addr_D[5]}]
set_load -pin_load 1 [get_ports {mem_addr_D[4]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[127]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[126]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[125]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[124]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[123]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[122]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[121]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[120]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[119]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[118]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[117]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[116]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[115]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[114]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[113]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[112]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[111]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[110]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[109]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[108]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[107]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[106]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[105]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[104]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[103]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[102]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[101]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[100]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[99]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[98]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[97]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[96]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[95]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[94]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[93]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[92]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[91]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[90]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[89]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[88]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[87]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[86]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[85]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[84]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[83]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[82]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[81]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[80]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[79]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[78]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[77]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[76]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[75]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[74]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[73]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[72]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[71]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[70]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[69]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[68]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[67]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[66]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[65]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[64]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[63]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[62]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[61]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[60]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[59]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[58]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[57]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[56]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[55]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[54]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[53]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[52]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[51]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[50]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[49]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[48]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[47]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[46]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[45]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[44]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[43]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[42]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[41]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[40]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[39]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[38]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[37]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[36]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[35]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[34]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[33]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[32]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[31]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[30]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[29]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[28]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[27]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[26]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[25]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[24]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[23]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[22]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[21]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[20]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[19]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[18]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[17]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[16]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[15]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[14]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[13]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[12]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[11]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[10]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[9]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[8]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[7]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[6]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[5]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[4]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[3]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[2]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[1]}]
set_load -pin_load 1 [get_ports {mem_wdata_D[0]}]
set_load -pin_load 1 [get_ports mem_read_I]
set_load -pin_load 1 [get_ports mem_write_I]
set_load -pin_load 1 [get_ports {mem_addr_I[31]}]
set_load -pin_load 1 [get_ports {mem_addr_I[30]}]
set_load -pin_load 1 [get_ports {mem_addr_I[29]}]
set_load -pin_load 1 [get_ports {mem_addr_I[28]}]
set_load -pin_load 1 [get_ports {mem_addr_I[27]}]
set_load -pin_load 1 [get_ports {mem_addr_I[26]}]
set_load -pin_load 1 [get_ports {mem_addr_I[25]}]
set_load -pin_load 1 [get_ports {mem_addr_I[24]}]
set_load -pin_load 1 [get_ports {mem_addr_I[23]}]
set_load -pin_load 1 [get_ports {mem_addr_I[22]}]
set_load -pin_load 1 [get_ports {mem_addr_I[21]}]
set_load -pin_load 1 [get_ports {mem_addr_I[20]}]
set_load -pin_load 1 [get_ports {mem_addr_I[19]}]
set_load -pin_load 1 [get_ports {mem_addr_I[18]}]
set_load -pin_load 1 [get_ports {mem_addr_I[17]}]
set_load -pin_load 1 [get_ports {mem_addr_I[16]}]
set_load -pin_load 1 [get_ports {mem_addr_I[15]}]
set_load -pin_load 1 [get_ports {mem_addr_I[14]}]
set_load -pin_load 1 [get_ports {mem_addr_I[13]}]
set_load -pin_load 1 [get_ports {mem_addr_I[12]}]
set_load -pin_load 1 [get_ports {mem_addr_I[11]}]
set_load -pin_load 1 [get_ports {mem_addr_I[10]}]
set_load -pin_load 1 [get_ports {mem_addr_I[9]}]
set_load -pin_load 1 [get_ports {mem_addr_I[8]}]
set_load -pin_load 1 [get_ports {mem_addr_I[7]}]
set_load -pin_load 1 [get_ports {mem_addr_I[6]}]
set_load -pin_load 1 [get_ports {mem_addr_I[5]}]
set_load -pin_load 1 [get_ports {mem_addr_I[4]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[127]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[126]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[125]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[124]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[123]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[122]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[121]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[120]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[119]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[118]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[117]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[116]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[115]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[114]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[113]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[112]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[111]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[110]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[109]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[108]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[107]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[106]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[105]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[104]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[103]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[102]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[101]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[100]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[99]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[98]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[97]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[96]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[95]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[94]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[93]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[92]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[91]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[90]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[89]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[88]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[87]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[86]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[85]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[84]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[83]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[82]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[81]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[80]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[79]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[78]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[77]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[76]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[75]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[74]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[73]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[72]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[71]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[70]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[69]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[68]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[67]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[66]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[65]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[64]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[63]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[62]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[61]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[60]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[59]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[58]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[57]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[56]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[55]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[54]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[53]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[52]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[51]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[50]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[49]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[48]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[47]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[46]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[45]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[44]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[43]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[42]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[41]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[40]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[39]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[38]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[37]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[36]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[35]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[34]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[33]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[32]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[31]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[30]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[29]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[28]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[27]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[26]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[25]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[24]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[23]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[22]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[21]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[20]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[19]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[18]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[17]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[16]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[15]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[14]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[13]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[12]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[11]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[10]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[9]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[8]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[7]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[6]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[5]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[4]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[3]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[2]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[1]}]
set_load -pin_load 1 [get_ports {mem_wdata_I[0]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[29]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[28]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[27]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[26]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[25]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[24]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[23]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[22]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[21]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[20]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[19]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[18]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[17]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[16]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[15]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[14]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[13]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[12]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[11]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[10]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[9]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[8]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[7]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[6]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[5]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[4]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[3]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[2]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[1]}]
set_load -pin_load 1 [get_ports {DCACHE_addr[0]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[31]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[30]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[29]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[28]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[27]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[26]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[25]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[24]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[23]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[22]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[21]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[20]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[19]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[18]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[17]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[16]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[15]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[14]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[13]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[12]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[11]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[10]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[9]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[8]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[7]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[6]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[5]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[4]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[3]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[2]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[1]}]
set_load -pin_load 1 [get_ports {DCACHE_wdata[0]}]
set_load -pin_load 1 [get_ports DCACHE_wen]
set_load -pin_load 1 [get_ports {PC[31]}]
set_load -pin_load 1 [get_ports {PC[30]}]
set_load -pin_load 1 [get_ports {PC[29]}]
set_load -pin_load 1 [get_ports {PC[28]}]
set_load -pin_load 1 [get_ports {PC[27]}]
set_load -pin_load 1 [get_ports {PC[26]}]
set_load -pin_load 1 [get_ports {PC[25]}]
set_load -pin_load 1 [get_ports {PC[24]}]
set_load -pin_load 1 [get_ports {PC[23]}]
set_load -pin_load 1 [get_ports {PC[22]}]
set_load -pin_load 1 [get_ports {PC[21]}]
set_load -pin_load 1 [get_ports {PC[20]}]
set_load -pin_load 1 [get_ports {PC[19]}]
set_load -pin_load 1 [get_ports {PC[18]}]
set_load -pin_load 1 [get_ports {PC[17]}]
set_load -pin_load 1 [get_ports {PC[16]}]
set_load -pin_load 1 [get_ports {PC[15]}]
set_load -pin_load 1 [get_ports {PC[14]}]
set_load -pin_load 1 [get_ports {PC[13]}]
set_load -pin_load 1 [get_ports {PC[12]}]
set_load -pin_load 1 [get_ports {PC[11]}]
set_load -pin_load 1 [get_ports {PC[10]}]
set_load -pin_load 1 [get_ports {PC[9]}]
set_load -pin_load 1 [get_ports {PC[8]}]
set_load -pin_load 1 [get_ports {PC[7]}]
set_load -pin_load 1 [get_ports {PC[6]}]
set_load -pin_load 1 [get_ports {PC[5]}]
set_load -pin_load 1 [get_ports {PC[4]}]
set_load -pin_load 1 [get_ports {PC[3]}]
set_load -pin_load 1 [get_ports {PC[2]}]
set_load -pin_load 1 [get_ports {PC[1]}]
set_load -pin_load 1 [get_ports {PC[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rst_n]
set_max_fanout 20 [get_ports {mem_rdata_D[127]}]
set_max_fanout 20 [get_ports {mem_rdata_D[126]}]
set_max_fanout 20 [get_ports {mem_rdata_D[125]}]
set_max_fanout 20 [get_ports {mem_rdata_D[124]}]
set_max_fanout 20 [get_ports {mem_rdata_D[123]}]
set_max_fanout 20 [get_ports {mem_rdata_D[122]}]
set_max_fanout 20 [get_ports {mem_rdata_D[121]}]
set_max_fanout 20 [get_ports {mem_rdata_D[120]}]
set_max_fanout 20 [get_ports {mem_rdata_D[119]}]
set_max_fanout 20 [get_ports {mem_rdata_D[118]}]
set_max_fanout 20 [get_ports {mem_rdata_D[117]}]
set_max_fanout 20 [get_ports {mem_rdata_D[116]}]
set_max_fanout 20 [get_ports {mem_rdata_D[115]}]
set_max_fanout 20 [get_ports {mem_rdata_D[114]}]
set_max_fanout 20 [get_ports {mem_rdata_D[113]}]
set_max_fanout 20 [get_ports {mem_rdata_D[112]}]
set_max_fanout 20 [get_ports {mem_rdata_D[111]}]
set_max_fanout 20 [get_ports {mem_rdata_D[110]}]
set_max_fanout 20 [get_ports {mem_rdata_D[109]}]
set_max_fanout 20 [get_ports {mem_rdata_D[108]}]
set_max_fanout 20 [get_ports {mem_rdata_D[107]}]
set_max_fanout 20 [get_ports {mem_rdata_D[106]}]
set_max_fanout 20 [get_ports {mem_rdata_D[105]}]
set_max_fanout 20 [get_ports {mem_rdata_D[104]}]
set_max_fanout 20 [get_ports {mem_rdata_D[103]}]
set_max_fanout 20 [get_ports {mem_rdata_D[102]}]
set_max_fanout 20 [get_ports {mem_rdata_D[101]}]
set_max_fanout 20 [get_ports {mem_rdata_D[100]}]
set_max_fanout 20 [get_ports {mem_rdata_D[99]}]
set_max_fanout 20 [get_ports {mem_rdata_D[98]}]
set_max_fanout 20 [get_ports {mem_rdata_D[97]}]
set_max_fanout 20 [get_ports {mem_rdata_D[96]}]
set_max_fanout 20 [get_ports {mem_rdata_D[95]}]
set_max_fanout 20 [get_ports {mem_rdata_D[94]}]
set_max_fanout 20 [get_ports {mem_rdata_D[93]}]
set_max_fanout 20 [get_ports {mem_rdata_D[92]}]
set_max_fanout 20 [get_ports {mem_rdata_D[91]}]
set_max_fanout 20 [get_ports {mem_rdata_D[90]}]
set_max_fanout 20 [get_ports {mem_rdata_D[89]}]
set_max_fanout 20 [get_ports {mem_rdata_D[88]}]
set_max_fanout 20 [get_ports {mem_rdata_D[87]}]
set_max_fanout 20 [get_ports {mem_rdata_D[86]}]
set_max_fanout 20 [get_ports {mem_rdata_D[85]}]
set_max_fanout 20 [get_ports {mem_rdata_D[84]}]
set_max_fanout 20 [get_ports {mem_rdata_D[83]}]
set_max_fanout 20 [get_ports {mem_rdata_D[82]}]
set_max_fanout 20 [get_ports {mem_rdata_D[81]}]
set_max_fanout 20 [get_ports {mem_rdata_D[80]}]
set_max_fanout 20 [get_ports {mem_rdata_D[79]}]
set_max_fanout 20 [get_ports {mem_rdata_D[78]}]
set_max_fanout 20 [get_ports {mem_rdata_D[77]}]
set_max_fanout 20 [get_ports {mem_rdata_D[76]}]
set_max_fanout 20 [get_ports {mem_rdata_D[75]}]
set_max_fanout 20 [get_ports {mem_rdata_D[74]}]
set_max_fanout 20 [get_ports {mem_rdata_D[73]}]
set_max_fanout 20 [get_ports {mem_rdata_D[72]}]
set_max_fanout 20 [get_ports {mem_rdata_D[71]}]
set_max_fanout 20 [get_ports {mem_rdata_D[70]}]
set_max_fanout 20 [get_ports {mem_rdata_D[69]}]
set_max_fanout 20 [get_ports {mem_rdata_D[68]}]
set_max_fanout 20 [get_ports {mem_rdata_D[67]}]
set_max_fanout 20 [get_ports {mem_rdata_D[66]}]
set_max_fanout 20 [get_ports {mem_rdata_D[65]}]
set_max_fanout 20 [get_ports {mem_rdata_D[64]}]
set_max_fanout 20 [get_ports {mem_rdata_D[63]}]
set_max_fanout 20 [get_ports {mem_rdata_D[62]}]
set_max_fanout 20 [get_ports {mem_rdata_D[61]}]
set_max_fanout 20 [get_ports {mem_rdata_D[60]}]
set_max_fanout 20 [get_ports {mem_rdata_D[59]}]
set_max_fanout 20 [get_ports {mem_rdata_D[58]}]
set_max_fanout 20 [get_ports {mem_rdata_D[57]}]
set_max_fanout 20 [get_ports {mem_rdata_D[56]}]
set_max_fanout 20 [get_ports {mem_rdata_D[55]}]
set_max_fanout 20 [get_ports {mem_rdata_D[54]}]
set_max_fanout 20 [get_ports {mem_rdata_D[53]}]
set_max_fanout 20 [get_ports {mem_rdata_D[52]}]
set_max_fanout 20 [get_ports {mem_rdata_D[51]}]
set_max_fanout 20 [get_ports {mem_rdata_D[50]}]
set_max_fanout 20 [get_ports {mem_rdata_D[49]}]
set_max_fanout 20 [get_ports {mem_rdata_D[48]}]
set_max_fanout 20 [get_ports {mem_rdata_D[47]}]
set_max_fanout 20 [get_ports {mem_rdata_D[46]}]
set_max_fanout 20 [get_ports {mem_rdata_D[45]}]
set_max_fanout 20 [get_ports {mem_rdata_D[44]}]
set_max_fanout 20 [get_ports {mem_rdata_D[43]}]
set_max_fanout 20 [get_ports {mem_rdata_D[42]}]
set_max_fanout 20 [get_ports {mem_rdata_D[41]}]
set_max_fanout 20 [get_ports {mem_rdata_D[40]}]
set_max_fanout 20 [get_ports {mem_rdata_D[39]}]
set_max_fanout 20 [get_ports {mem_rdata_D[38]}]
set_max_fanout 20 [get_ports {mem_rdata_D[37]}]
set_max_fanout 20 [get_ports {mem_rdata_D[36]}]
set_max_fanout 20 [get_ports {mem_rdata_D[35]}]
set_max_fanout 20 [get_ports {mem_rdata_D[34]}]
set_max_fanout 20 [get_ports {mem_rdata_D[33]}]
set_max_fanout 20 [get_ports {mem_rdata_D[32]}]
set_max_fanout 20 [get_ports {mem_rdata_D[31]}]
set_max_fanout 20 [get_ports {mem_rdata_D[30]}]
set_max_fanout 20 [get_ports {mem_rdata_D[29]}]
set_max_fanout 20 [get_ports {mem_rdata_D[28]}]
set_max_fanout 20 [get_ports {mem_rdata_D[27]}]
set_max_fanout 20 [get_ports {mem_rdata_D[26]}]
set_max_fanout 20 [get_ports {mem_rdata_D[25]}]
set_max_fanout 20 [get_ports {mem_rdata_D[24]}]
set_max_fanout 20 [get_ports {mem_rdata_D[23]}]
set_max_fanout 20 [get_ports {mem_rdata_D[22]}]
set_max_fanout 20 [get_ports {mem_rdata_D[21]}]
set_max_fanout 20 [get_ports {mem_rdata_D[20]}]
set_max_fanout 20 [get_ports {mem_rdata_D[19]}]
set_max_fanout 20 [get_ports {mem_rdata_D[18]}]
set_max_fanout 20 [get_ports {mem_rdata_D[17]}]
set_max_fanout 20 [get_ports {mem_rdata_D[16]}]
set_max_fanout 20 [get_ports {mem_rdata_D[15]}]
set_max_fanout 20 [get_ports {mem_rdata_D[14]}]
set_max_fanout 20 [get_ports {mem_rdata_D[13]}]
set_max_fanout 20 [get_ports {mem_rdata_D[12]}]
set_max_fanout 20 [get_ports {mem_rdata_D[11]}]
set_max_fanout 20 [get_ports {mem_rdata_D[10]}]
set_max_fanout 20 [get_ports {mem_rdata_D[9]}]
set_max_fanout 20 [get_ports {mem_rdata_D[8]}]
set_max_fanout 20 [get_ports {mem_rdata_D[7]}]
set_max_fanout 20 [get_ports {mem_rdata_D[6]}]
set_max_fanout 20 [get_ports {mem_rdata_D[5]}]
set_max_fanout 20 [get_ports {mem_rdata_D[4]}]
set_max_fanout 20 [get_ports {mem_rdata_D[3]}]
set_max_fanout 20 [get_ports {mem_rdata_D[2]}]
set_max_fanout 20 [get_ports {mem_rdata_D[1]}]
set_max_fanout 20 [get_ports {mem_rdata_D[0]}]
set_max_fanout 20 [get_ports mem_ready_D]
set_max_fanout 20 [get_ports {mem_rdata_I[127]}]
set_max_fanout 20 [get_ports {mem_rdata_I[126]}]
set_max_fanout 20 [get_ports {mem_rdata_I[125]}]
set_max_fanout 20 [get_ports {mem_rdata_I[124]}]
set_max_fanout 20 [get_ports {mem_rdata_I[123]}]
set_max_fanout 20 [get_ports {mem_rdata_I[122]}]
set_max_fanout 20 [get_ports {mem_rdata_I[121]}]
set_max_fanout 20 [get_ports {mem_rdata_I[120]}]
set_max_fanout 20 [get_ports {mem_rdata_I[119]}]
set_max_fanout 20 [get_ports {mem_rdata_I[118]}]
set_max_fanout 20 [get_ports {mem_rdata_I[117]}]
set_max_fanout 20 [get_ports {mem_rdata_I[116]}]
set_max_fanout 20 [get_ports {mem_rdata_I[115]}]
set_max_fanout 20 [get_ports {mem_rdata_I[114]}]
set_max_fanout 20 [get_ports {mem_rdata_I[113]}]
set_max_fanout 20 [get_ports {mem_rdata_I[112]}]
set_max_fanout 20 [get_ports {mem_rdata_I[111]}]
set_max_fanout 20 [get_ports {mem_rdata_I[110]}]
set_max_fanout 20 [get_ports {mem_rdata_I[109]}]
set_max_fanout 20 [get_ports {mem_rdata_I[108]}]
set_max_fanout 20 [get_ports {mem_rdata_I[107]}]
set_max_fanout 20 [get_ports {mem_rdata_I[106]}]
set_max_fanout 20 [get_ports {mem_rdata_I[105]}]
set_max_fanout 20 [get_ports {mem_rdata_I[104]}]
set_max_fanout 20 [get_ports {mem_rdata_I[103]}]
set_max_fanout 20 [get_ports {mem_rdata_I[102]}]
set_max_fanout 20 [get_ports {mem_rdata_I[101]}]
set_max_fanout 20 [get_ports {mem_rdata_I[100]}]
set_max_fanout 20 [get_ports {mem_rdata_I[99]}]
set_max_fanout 20 [get_ports {mem_rdata_I[98]}]
set_max_fanout 20 [get_ports {mem_rdata_I[97]}]
set_max_fanout 20 [get_ports {mem_rdata_I[96]}]
set_max_fanout 20 [get_ports {mem_rdata_I[95]}]
set_max_fanout 20 [get_ports {mem_rdata_I[94]}]
set_max_fanout 20 [get_ports {mem_rdata_I[93]}]
set_max_fanout 20 [get_ports {mem_rdata_I[92]}]
set_max_fanout 20 [get_ports {mem_rdata_I[91]}]
set_max_fanout 20 [get_ports {mem_rdata_I[90]}]
set_max_fanout 20 [get_ports {mem_rdata_I[89]}]
set_max_fanout 20 [get_ports {mem_rdata_I[88]}]
set_max_fanout 20 [get_ports {mem_rdata_I[87]}]
set_max_fanout 20 [get_ports {mem_rdata_I[86]}]
set_max_fanout 20 [get_ports {mem_rdata_I[85]}]
set_max_fanout 20 [get_ports {mem_rdata_I[84]}]
set_max_fanout 20 [get_ports {mem_rdata_I[83]}]
set_max_fanout 20 [get_ports {mem_rdata_I[82]}]
set_max_fanout 20 [get_ports {mem_rdata_I[81]}]
set_max_fanout 20 [get_ports {mem_rdata_I[80]}]
set_max_fanout 20 [get_ports {mem_rdata_I[79]}]
set_max_fanout 20 [get_ports {mem_rdata_I[78]}]
set_max_fanout 20 [get_ports {mem_rdata_I[77]}]
set_max_fanout 20 [get_ports {mem_rdata_I[76]}]
set_max_fanout 20 [get_ports {mem_rdata_I[75]}]
set_max_fanout 20 [get_ports {mem_rdata_I[74]}]
set_max_fanout 20 [get_ports {mem_rdata_I[73]}]
set_max_fanout 20 [get_ports {mem_rdata_I[72]}]
set_max_fanout 20 [get_ports {mem_rdata_I[71]}]
set_max_fanout 20 [get_ports {mem_rdata_I[70]}]
set_max_fanout 20 [get_ports {mem_rdata_I[69]}]
set_max_fanout 20 [get_ports {mem_rdata_I[68]}]
set_max_fanout 20 [get_ports {mem_rdata_I[67]}]
set_max_fanout 20 [get_ports {mem_rdata_I[66]}]
set_max_fanout 20 [get_ports {mem_rdata_I[65]}]
set_max_fanout 20 [get_ports {mem_rdata_I[64]}]
set_max_fanout 20 [get_ports {mem_rdata_I[63]}]
set_max_fanout 20 [get_ports {mem_rdata_I[62]}]
set_max_fanout 20 [get_ports {mem_rdata_I[61]}]
set_max_fanout 20 [get_ports {mem_rdata_I[60]}]
set_max_fanout 20 [get_ports {mem_rdata_I[59]}]
set_max_fanout 20 [get_ports {mem_rdata_I[58]}]
set_max_fanout 20 [get_ports {mem_rdata_I[57]}]
set_max_fanout 20 [get_ports {mem_rdata_I[56]}]
set_max_fanout 20 [get_ports {mem_rdata_I[55]}]
set_max_fanout 20 [get_ports {mem_rdata_I[54]}]
set_max_fanout 20 [get_ports {mem_rdata_I[53]}]
set_max_fanout 20 [get_ports {mem_rdata_I[52]}]
set_max_fanout 20 [get_ports {mem_rdata_I[51]}]
set_max_fanout 20 [get_ports {mem_rdata_I[50]}]
set_max_fanout 20 [get_ports {mem_rdata_I[49]}]
set_max_fanout 20 [get_ports {mem_rdata_I[48]}]
set_max_fanout 20 [get_ports {mem_rdata_I[47]}]
set_max_fanout 20 [get_ports {mem_rdata_I[46]}]
set_max_fanout 20 [get_ports {mem_rdata_I[45]}]
set_max_fanout 20 [get_ports {mem_rdata_I[44]}]
set_max_fanout 20 [get_ports {mem_rdata_I[43]}]
set_max_fanout 20 [get_ports {mem_rdata_I[42]}]
set_max_fanout 20 [get_ports {mem_rdata_I[41]}]
set_max_fanout 20 [get_ports {mem_rdata_I[40]}]
set_max_fanout 20 [get_ports {mem_rdata_I[39]}]
set_max_fanout 20 [get_ports {mem_rdata_I[38]}]
set_max_fanout 20 [get_ports {mem_rdata_I[37]}]
set_max_fanout 20 [get_ports {mem_rdata_I[36]}]
set_max_fanout 20 [get_ports {mem_rdata_I[35]}]
set_max_fanout 20 [get_ports {mem_rdata_I[34]}]
set_max_fanout 20 [get_ports {mem_rdata_I[33]}]
set_max_fanout 20 [get_ports {mem_rdata_I[32]}]
set_max_fanout 20 [get_ports {mem_rdata_I[31]}]
set_max_fanout 20 [get_ports {mem_rdata_I[30]}]
set_max_fanout 20 [get_ports {mem_rdata_I[29]}]
set_max_fanout 20 [get_ports {mem_rdata_I[28]}]
set_max_fanout 20 [get_ports {mem_rdata_I[27]}]
set_max_fanout 20 [get_ports {mem_rdata_I[26]}]
set_max_fanout 20 [get_ports {mem_rdata_I[25]}]
set_max_fanout 20 [get_ports {mem_rdata_I[24]}]
set_max_fanout 20 [get_ports {mem_rdata_I[23]}]
set_max_fanout 20 [get_ports {mem_rdata_I[22]}]
set_max_fanout 20 [get_ports {mem_rdata_I[21]}]
set_max_fanout 20 [get_ports {mem_rdata_I[20]}]
set_max_fanout 20 [get_ports {mem_rdata_I[19]}]
set_max_fanout 20 [get_ports {mem_rdata_I[18]}]
set_max_fanout 20 [get_ports {mem_rdata_I[17]}]
set_max_fanout 20 [get_ports {mem_rdata_I[16]}]
set_max_fanout 20 [get_ports {mem_rdata_I[15]}]
set_max_fanout 20 [get_ports {mem_rdata_I[14]}]
set_max_fanout 20 [get_ports {mem_rdata_I[13]}]
set_max_fanout 20 [get_ports {mem_rdata_I[12]}]
set_max_fanout 20 [get_ports {mem_rdata_I[11]}]
set_max_fanout 20 [get_ports {mem_rdata_I[10]}]
set_max_fanout 20 [get_ports {mem_rdata_I[9]}]
set_max_fanout 20 [get_ports {mem_rdata_I[8]}]
set_max_fanout 20 [get_ports {mem_rdata_I[7]}]
set_max_fanout 20 [get_ports {mem_rdata_I[6]}]
set_max_fanout 20 [get_ports {mem_rdata_I[5]}]
set_max_fanout 20 [get_ports {mem_rdata_I[4]}]
set_max_fanout 20 [get_ports {mem_rdata_I[3]}]
set_max_fanout 20 [get_ports {mem_rdata_I[2]}]
set_max_fanout 20 [get_ports {mem_rdata_I[1]}]
set_max_fanout 20 [get_ports {mem_rdata_I[0]}]
set_max_fanout 20 [get_ports mem_ready_I]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 4.2  -waveform {0 2.1}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[127]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[126]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[125]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[124]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[123]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[122]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[121]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[120]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[119]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[118]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[117]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[116]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[115]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[114]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[113]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[112]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[111]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[110]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[109]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[108]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[107]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[106]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[105]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[104]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[103]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[102]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[101]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[100]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[99]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[98]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[97]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[96]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[95]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[94]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[93]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[92]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[91]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[90]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[89]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[88]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[87]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[86]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[85]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[84]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[83]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[82]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[81]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[80]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[79]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[78]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[77]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[76]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[75]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[74]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[73]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[72]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[71]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[70]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[69]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[68]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[67]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[66]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[65]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[64]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[63]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[62]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[61]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[60]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[59]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[58]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[57]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[56]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[55]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[54]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[53]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[52]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[51]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[50]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[49]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[48]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[47]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[46]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[45]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[44]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[43]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[42]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[41]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[40]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[39]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[38]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[37]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[36]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[35]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[34]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[33]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[32]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[31]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[30]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[29]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[28]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[27]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[26]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[25]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[24]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[23]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[22]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[21]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[20]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[19]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[18]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[17]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[16]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[15]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[14]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[13]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[12]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[11]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[10]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[9]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[8]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[7]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[6]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[5]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[4]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[3]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[2]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[1]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_D[0]}]
set_input_delay -clock clk  2.1  [get_ports mem_ready_D]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[127]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[126]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[125]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[124]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[123]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[122]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[121]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[120]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[119]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[118]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[117]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[116]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[115]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[114]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[113]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[112]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[111]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[110]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[109]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[108]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[107]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[106]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[105]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[104]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[103]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[102]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[101]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[100]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[99]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[98]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[97]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[96]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[95]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[94]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[93]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[92]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[91]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[90]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[89]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[88]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[87]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[86]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[85]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[84]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[83]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[82]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[81]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[80]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[79]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[78]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[77]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[76]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[75]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[74]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[73]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[72]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[71]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[70]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[69]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[68]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[67]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[66]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[65]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[64]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[63]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[62]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[61]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[60]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[59]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[58]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[57]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[56]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[55]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[54]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[53]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[52]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[51]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[50]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[49]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[48]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[47]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[46]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[45]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[44]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[43]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[42]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[41]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[40]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[39]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[38]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[37]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[36]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[35]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[34]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[33]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[32]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[31]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[30]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[29]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[28]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[27]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[26]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[25]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[24]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[23]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[22]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[21]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[20]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[19]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[18]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[17]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[16]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[15]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[14]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[13]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[12]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[11]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[10]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[9]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[8]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[7]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[6]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[5]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[4]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[3]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[2]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[1]}]
set_input_delay -clock clk  2.1  [get_ports {mem_rdata_I[0]}]
set_input_delay -clock clk  2.1  [get_ports mem_ready_I]
set_input_delay -clock clk  0.1  [get_ports rst_n]
set_output_delay -clock clk  0.1  [get_ports mem_read_D]
set_output_delay -clock clk  0.1  [get_ports mem_write_D]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[31]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[30]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[29]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[28]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[27]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[26]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[25]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[24]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[23]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[22]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[21]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[20]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[19]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[18]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[17]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[16]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[15]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[14]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[13]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[12]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[11]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[10]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[9]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[8]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[7]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[6]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[5]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_D[4]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[127]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[126]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[125]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[124]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[123]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[122]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[121]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[120]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[119]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[118]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[117]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[116]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[115]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[114]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[113]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[112]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[111]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[110]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[109]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[108]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[107]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[106]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[105]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[104]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[103]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[102]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[101]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[100]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[99]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[98]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[97]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[96]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[95]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[94]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[93]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[92]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[91]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[90]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[89]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[88]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[87]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[86]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[85]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[84]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[83]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[82]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[81]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[80]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[79]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[78]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[77]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[76]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[75]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[74]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[73]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[72]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[71]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[70]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[69]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[68]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[67]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[66]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[65]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[64]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[63]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[62]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[61]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[60]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[59]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[58]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[57]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[56]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[55]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[54]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[53]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[52]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[51]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[50]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[49]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[48]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[47]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[46]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[45]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[44]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[43]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[42]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[41]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[40]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[39]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[38]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[37]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[36]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[35]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[34]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[33]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[32]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[31]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[30]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[29]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[28]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[27]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[26]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[25]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[24]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[23]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[22]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[21]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[20]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[19]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[18]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[17]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[16]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[15]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[14]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[13]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[12]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[11]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[10]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[9]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[8]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[7]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[6]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[5]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[4]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[3]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[2]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[1]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_D[0]}]
set_output_delay -clock clk  0.1  [get_ports mem_read_I]
set_output_delay -clock clk  0.1  [get_ports mem_write_I]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[31]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[30]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[29]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[28]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[27]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[26]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[25]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[24]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[23]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[22]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[21]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[20]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[19]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[18]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[17]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[16]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[15]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[14]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[13]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[12]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[11]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[10]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[9]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[8]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[7]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[6]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[5]}]
set_output_delay -clock clk  0.1  [get_ports {mem_addr_I[4]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[127]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[126]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[125]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[124]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[123]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[122]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[121]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[120]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[119]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[118]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[117]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[116]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[115]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[114]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[113]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[112]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[111]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[110]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[109]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[108]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[107]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[106]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[105]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[104]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[103]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[102]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[101]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[100]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[99]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[98]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[97]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[96]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[95]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[94]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[93]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[92]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[91]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[90]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[89]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[88]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[87]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[86]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[85]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[84]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[83]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[82]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[81]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[80]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[79]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[78]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[77]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[76]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[75]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[74]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[73]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[72]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[71]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[70]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[69]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[68]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[67]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[66]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[65]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[64]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[63]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[62]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[61]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[60]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[59]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[58]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[57]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[56]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[55]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[54]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[53]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[52]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[51]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[50]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[49]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[48]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[47]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[46]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[45]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[44]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[43]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[42]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[41]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[40]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[39]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[38]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[37]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[36]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[35]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[34]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[33]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[32]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[31]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[30]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[29]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[28]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[27]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[26]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[25]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[24]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[23]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[22]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[21]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[20]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[19]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[18]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[17]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[16]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[15]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[14]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[13]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[12]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[11]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[10]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[9]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[8]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[7]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[6]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[5]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[4]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[3]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[2]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[1]}]
set_output_delay -clock clk  0.1  [get_ports {mem_wdata_I[0]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[29]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[28]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[27]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[26]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[25]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[24]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[23]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[22]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[21]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[20]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[19]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[18]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[17]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[16]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[15]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[14]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[13]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[12]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[11]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[10]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[9]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[8]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[7]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[6]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[5]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[4]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[31]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[30]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[29]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[28]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[27]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[26]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[25]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[24]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[23]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[22]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[21]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[20]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[19]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[18]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[17]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[16]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[15]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[14]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[13]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[12]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[11]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[10]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[9]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[8]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[7]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[6]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[5]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[4]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[3]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[2]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[1]}]
set_output_delay -clock clk  0.1  [get_ports {DCACHE_wdata[0]}]
set_output_delay -clock clk  0.1  [get_ports DCACHE_wen]
set_output_delay -clock clk  0.1  [get_ports {PC[31]}]
set_output_delay -clock clk  0.1  [get_ports {PC[30]}]
set_output_delay -clock clk  0.1  [get_ports {PC[29]}]
set_output_delay -clock clk  0.1  [get_ports {PC[28]}]
set_output_delay -clock clk  0.1  [get_ports {PC[27]}]
set_output_delay -clock clk  0.1  [get_ports {PC[26]}]
set_output_delay -clock clk  0.1  [get_ports {PC[25]}]
set_output_delay -clock clk  0.1  [get_ports {PC[24]}]
set_output_delay -clock clk  0.1  [get_ports {PC[23]}]
set_output_delay -clock clk  0.1  [get_ports {PC[22]}]
set_output_delay -clock clk  0.1  [get_ports {PC[21]}]
set_output_delay -clock clk  0.1  [get_ports {PC[20]}]
set_output_delay -clock clk  0.1  [get_ports {PC[19]}]
set_output_delay -clock clk  0.1  [get_ports {PC[18]}]
set_output_delay -clock clk  0.1  [get_ports {PC[17]}]
set_output_delay -clock clk  0.1  [get_ports {PC[16]}]
set_output_delay -clock clk  0.1  [get_ports {PC[15]}]
set_output_delay -clock clk  0.1  [get_ports {PC[14]}]
set_output_delay -clock clk  0.1  [get_ports {PC[13]}]
set_output_delay -clock clk  0.1  [get_ports {PC[12]}]
set_output_delay -clock clk  0.1  [get_ports {PC[11]}]
set_output_delay -clock clk  0.1  [get_ports {PC[10]}]
set_output_delay -clock clk  0.1  [get_ports {PC[9]}]
set_output_delay -clock clk  0.1  [get_ports {PC[8]}]
set_output_delay -clock clk  0.1  [get_ports {PC[7]}]
set_output_delay -clock clk  0.1  [get_ports {PC[6]}]
set_output_delay -clock clk  0.1  [get_ports {PC[5]}]
set_output_delay -clock clk  0.1  [get_ports {PC[4]}]
set_output_delay -clock clk  0.1  [get_ports {PC[3]}]
set_output_delay -clock clk  0.1  [get_ports {PC[2]}]
set_output_delay -clock clk  0.1  [get_ports {PC[1]}]
set_output_delay -clock clk  0.1  [get_ports {PC[0]}]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_drive 1  [get_ports rst_n]
set_drive 1  [get_ports {mem_rdata_D[127]}]
set_drive 1  [get_ports {mem_rdata_D[126]}]
set_drive 1  [get_ports {mem_rdata_D[125]}]
set_drive 1  [get_ports {mem_rdata_D[124]}]
set_drive 1  [get_ports {mem_rdata_D[123]}]
set_drive 1  [get_ports {mem_rdata_D[122]}]
set_drive 1  [get_ports {mem_rdata_D[121]}]
set_drive 1  [get_ports {mem_rdata_D[120]}]
set_drive 1  [get_ports {mem_rdata_D[119]}]
set_drive 1  [get_ports {mem_rdata_D[118]}]
set_drive 1  [get_ports {mem_rdata_D[117]}]
set_drive 1  [get_ports {mem_rdata_D[116]}]
set_drive 1  [get_ports {mem_rdata_D[115]}]
set_drive 1  [get_ports {mem_rdata_D[114]}]
set_drive 1  [get_ports {mem_rdata_D[113]}]
set_drive 1  [get_ports {mem_rdata_D[112]}]
set_drive 1  [get_ports {mem_rdata_D[111]}]
set_drive 1  [get_ports {mem_rdata_D[110]}]
set_drive 1  [get_ports {mem_rdata_D[109]}]
set_drive 1  [get_ports {mem_rdata_D[108]}]
set_drive 1  [get_ports {mem_rdata_D[107]}]
set_drive 1  [get_ports {mem_rdata_D[106]}]
set_drive 1  [get_ports {mem_rdata_D[105]}]
set_drive 1  [get_ports {mem_rdata_D[104]}]
set_drive 1  [get_ports {mem_rdata_D[103]}]
set_drive 1  [get_ports {mem_rdata_D[102]}]
set_drive 1  [get_ports {mem_rdata_D[101]}]
set_drive 1  [get_ports {mem_rdata_D[100]}]
set_drive 1  [get_ports {mem_rdata_D[99]}]
set_drive 1  [get_ports {mem_rdata_D[98]}]
set_drive 1  [get_ports {mem_rdata_D[97]}]
set_drive 1  [get_ports {mem_rdata_D[96]}]
set_drive 1  [get_ports {mem_rdata_D[95]}]
set_drive 1  [get_ports {mem_rdata_D[94]}]
set_drive 1  [get_ports {mem_rdata_D[93]}]
set_drive 1  [get_ports {mem_rdata_D[92]}]
set_drive 1  [get_ports {mem_rdata_D[91]}]
set_drive 1  [get_ports {mem_rdata_D[90]}]
set_drive 1  [get_ports {mem_rdata_D[89]}]
set_drive 1  [get_ports {mem_rdata_D[88]}]
set_drive 1  [get_ports {mem_rdata_D[87]}]
set_drive 1  [get_ports {mem_rdata_D[86]}]
set_drive 1  [get_ports {mem_rdata_D[85]}]
set_drive 1  [get_ports {mem_rdata_D[84]}]
set_drive 1  [get_ports {mem_rdata_D[83]}]
set_drive 1  [get_ports {mem_rdata_D[82]}]
set_drive 1  [get_ports {mem_rdata_D[81]}]
set_drive 1  [get_ports {mem_rdata_D[80]}]
set_drive 1  [get_ports {mem_rdata_D[79]}]
set_drive 1  [get_ports {mem_rdata_D[78]}]
set_drive 1  [get_ports {mem_rdata_D[77]}]
set_drive 1  [get_ports {mem_rdata_D[76]}]
set_drive 1  [get_ports {mem_rdata_D[75]}]
set_drive 1  [get_ports {mem_rdata_D[74]}]
set_drive 1  [get_ports {mem_rdata_D[73]}]
set_drive 1  [get_ports {mem_rdata_D[72]}]
set_drive 1  [get_ports {mem_rdata_D[71]}]
set_drive 1  [get_ports {mem_rdata_D[70]}]
set_drive 1  [get_ports {mem_rdata_D[69]}]
set_drive 1  [get_ports {mem_rdata_D[68]}]
set_drive 1  [get_ports {mem_rdata_D[67]}]
set_drive 1  [get_ports {mem_rdata_D[66]}]
set_drive 1  [get_ports {mem_rdata_D[65]}]
set_drive 1  [get_ports {mem_rdata_D[64]}]
set_drive 1  [get_ports {mem_rdata_D[63]}]
set_drive 1  [get_ports {mem_rdata_D[62]}]
set_drive 1  [get_ports {mem_rdata_D[61]}]
set_drive 1  [get_ports {mem_rdata_D[60]}]
set_drive 1  [get_ports {mem_rdata_D[59]}]
set_drive 1  [get_ports {mem_rdata_D[58]}]
set_drive 1  [get_ports {mem_rdata_D[57]}]
set_drive 1  [get_ports {mem_rdata_D[56]}]
set_drive 1  [get_ports {mem_rdata_D[55]}]
set_drive 1  [get_ports {mem_rdata_D[54]}]
set_drive 1  [get_ports {mem_rdata_D[53]}]
set_drive 1  [get_ports {mem_rdata_D[52]}]
set_drive 1  [get_ports {mem_rdata_D[51]}]
set_drive 1  [get_ports {mem_rdata_D[50]}]
set_drive 1  [get_ports {mem_rdata_D[49]}]
set_drive 1  [get_ports {mem_rdata_D[48]}]
set_drive 1  [get_ports {mem_rdata_D[47]}]
set_drive 1  [get_ports {mem_rdata_D[46]}]
set_drive 1  [get_ports {mem_rdata_D[45]}]
set_drive 1  [get_ports {mem_rdata_D[44]}]
set_drive 1  [get_ports {mem_rdata_D[43]}]
set_drive 1  [get_ports {mem_rdata_D[42]}]
set_drive 1  [get_ports {mem_rdata_D[41]}]
set_drive 1  [get_ports {mem_rdata_D[40]}]
set_drive 1  [get_ports {mem_rdata_D[39]}]
set_drive 1  [get_ports {mem_rdata_D[38]}]
set_drive 1  [get_ports {mem_rdata_D[37]}]
set_drive 1  [get_ports {mem_rdata_D[36]}]
set_drive 1  [get_ports {mem_rdata_D[35]}]
set_drive 1  [get_ports {mem_rdata_D[34]}]
set_drive 1  [get_ports {mem_rdata_D[33]}]
set_drive 1  [get_ports {mem_rdata_D[32]}]
set_drive 1  [get_ports {mem_rdata_D[31]}]
set_drive 1  [get_ports {mem_rdata_D[30]}]
set_drive 1  [get_ports {mem_rdata_D[29]}]
set_drive 1  [get_ports {mem_rdata_D[28]}]
set_drive 1  [get_ports {mem_rdata_D[27]}]
set_drive 1  [get_ports {mem_rdata_D[26]}]
set_drive 1  [get_ports {mem_rdata_D[25]}]
set_drive 1  [get_ports {mem_rdata_D[24]}]
set_drive 1  [get_ports {mem_rdata_D[23]}]
set_drive 1  [get_ports {mem_rdata_D[22]}]
set_drive 1  [get_ports {mem_rdata_D[21]}]
set_drive 1  [get_ports {mem_rdata_D[20]}]
set_drive 1  [get_ports {mem_rdata_D[19]}]
set_drive 1  [get_ports {mem_rdata_D[18]}]
set_drive 1  [get_ports {mem_rdata_D[17]}]
set_drive 1  [get_ports {mem_rdata_D[16]}]
set_drive 1  [get_ports {mem_rdata_D[15]}]
set_drive 1  [get_ports {mem_rdata_D[14]}]
set_drive 1  [get_ports {mem_rdata_D[13]}]
set_drive 1  [get_ports {mem_rdata_D[12]}]
set_drive 1  [get_ports {mem_rdata_D[11]}]
set_drive 1  [get_ports {mem_rdata_D[10]}]
set_drive 1  [get_ports {mem_rdata_D[9]}]
set_drive 1  [get_ports {mem_rdata_D[8]}]
set_drive 1  [get_ports {mem_rdata_D[7]}]
set_drive 1  [get_ports {mem_rdata_D[6]}]
set_drive 1  [get_ports {mem_rdata_D[5]}]
set_drive 1  [get_ports {mem_rdata_D[4]}]
set_drive 1  [get_ports {mem_rdata_D[3]}]
set_drive 1  [get_ports {mem_rdata_D[2]}]
set_drive 1  [get_ports {mem_rdata_D[1]}]
set_drive 1  [get_ports {mem_rdata_D[0]}]
set_drive 1  [get_ports mem_ready_D]
set_drive 1  [get_ports {mem_rdata_I[127]}]
set_drive 1  [get_ports {mem_rdata_I[126]}]
set_drive 1  [get_ports {mem_rdata_I[125]}]
set_drive 1  [get_ports {mem_rdata_I[124]}]
set_drive 1  [get_ports {mem_rdata_I[123]}]
set_drive 1  [get_ports {mem_rdata_I[122]}]
set_drive 1  [get_ports {mem_rdata_I[121]}]
set_drive 1  [get_ports {mem_rdata_I[120]}]
set_drive 1  [get_ports {mem_rdata_I[119]}]
set_drive 1  [get_ports {mem_rdata_I[118]}]
set_drive 1  [get_ports {mem_rdata_I[117]}]
set_drive 1  [get_ports {mem_rdata_I[116]}]
set_drive 1  [get_ports {mem_rdata_I[115]}]
set_drive 1  [get_ports {mem_rdata_I[114]}]
set_drive 1  [get_ports {mem_rdata_I[113]}]
set_drive 1  [get_ports {mem_rdata_I[112]}]
set_drive 1  [get_ports {mem_rdata_I[111]}]
set_drive 1  [get_ports {mem_rdata_I[110]}]
set_drive 1  [get_ports {mem_rdata_I[109]}]
set_drive 1  [get_ports {mem_rdata_I[108]}]
set_drive 1  [get_ports {mem_rdata_I[107]}]
set_drive 1  [get_ports {mem_rdata_I[106]}]
set_drive 1  [get_ports {mem_rdata_I[105]}]
set_drive 1  [get_ports {mem_rdata_I[104]}]
set_drive 1  [get_ports {mem_rdata_I[103]}]
set_drive 1  [get_ports {mem_rdata_I[102]}]
set_drive 1  [get_ports {mem_rdata_I[101]}]
set_drive 1  [get_ports {mem_rdata_I[100]}]
set_drive 1  [get_ports {mem_rdata_I[99]}]
set_drive 1  [get_ports {mem_rdata_I[98]}]
set_drive 1  [get_ports {mem_rdata_I[97]}]
set_drive 1  [get_ports {mem_rdata_I[96]}]
set_drive 1  [get_ports {mem_rdata_I[95]}]
set_drive 1  [get_ports {mem_rdata_I[94]}]
set_drive 1  [get_ports {mem_rdata_I[93]}]
set_drive 1  [get_ports {mem_rdata_I[92]}]
set_drive 1  [get_ports {mem_rdata_I[91]}]
set_drive 1  [get_ports {mem_rdata_I[90]}]
set_drive 1  [get_ports {mem_rdata_I[89]}]
set_drive 1  [get_ports {mem_rdata_I[88]}]
set_drive 1  [get_ports {mem_rdata_I[87]}]
set_drive 1  [get_ports {mem_rdata_I[86]}]
set_drive 1  [get_ports {mem_rdata_I[85]}]
set_drive 1  [get_ports {mem_rdata_I[84]}]
set_drive 1  [get_ports {mem_rdata_I[83]}]
set_drive 1  [get_ports {mem_rdata_I[82]}]
set_drive 1  [get_ports {mem_rdata_I[81]}]
set_drive 1  [get_ports {mem_rdata_I[80]}]
set_drive 1  [get_ports {mem_rdata_I[79]}]
set_drive 1  [get_ports {mem_rdata_I[78]}]
set_drive 1  [get_ports {mem_rdata_I[77]}]
set_drive 1  [get_ports {mem_rdata_I[76]}]
set_drive 1  [get_ports {mem_rdata_I[75]}]
set_drive 1  [get_ports {mem_rdata_I[74]}]
set_drive 1  [get_ports {mem_rdata_I[73]}]
set_drive 1  [get_ports {mem_rdata_I[72]}]
set_drive 1  [get_ports {mem_rdata_I[71]}]
set_drive 1  [get_ports {mem_rdata_I[70]}]
set_drive 1  [get_ports {mem_rdata_I[69]}]
set_drive 1  [get_ports {mem_rdata_I[68]}]
set_drive 1  [get_ports {mem_rdata_I[67]}]
set_drive 1  [get_ports {mem_rdata_I[66]}]
set_drive 1  [get_ports {mem_rdata_I[65]}]
set_drive 1  [get_ports {mem_rdata_I[64]}]
set_drive 1  [get_ports {mem_rdata_I[63]}]
set_drive 1  [get_ports {mem_rdata_I[62]}]
set_drive 1  [get_ports {mem_rdata_I[61]}]
set_drive 1  [get_ports {mem_rdata_I[60]}]
set_drive 1  [get_ports {mem_rdata_I[59]}]
set_drive 1  [get_ports {mem_rdata_I[58]}]
set_drive 1  [get_ports {mem_rdata_I[57]}]
set_drive 1  [get_ports {mem_rdata_I[56]}]
set_drive 1  [get_ports {mem_rdata_I[55]}]
set_drive 1  [get_ports {mem_rdata_I[54]}]
set_drive 1  [get_ports {mem_rdata_I[53]}]
set_drive 1  [get_ports {mem_rdata_I[52]}]
set_drive 1  [get_ports {mem_rdata_I[51]}]
set_drive 1  [get_ports {mem_rdata_I[50]}]
set_drive 1  [get_ports {mem_rdata_I[49]}]
set_drive 1  [get_ports {mem_rdata_I[48]}]
set_drive 1  [get_ports {mem_rdata_I[47]}]
set_drive 1  [get_ports {mem_rdata_I[46]}]
set_drive 1  [get_ports {mem_rdata_I[45]}]
set_drive 1  [get_ports {mem_rdata_I[44]}]
set_drive 1  [get_ports {mem_rdata_I[43]}]
set_drive 1  [get_ports {mem_rdata_I[42]}]
set_drive 1  [get_ports {mem_rdata_I[41]}]
set_drive 1  [get_ports {mem_rdata_I[40]}]
set_drive 1  [get_ports {mem_rdata_I[39]}]
set_drive 1  [get_ports {mem_rdata_I[38]}]
set_drive 1  [get_ports {mem_rdata_I[37]}]
set_drive 1  [get_ports {mem_rdata_I[36]}]
set_drive 1  [get_ports {mem_rdata_I[35]}]
set_drive 1  [get_ports {mem_rdata_I[34]}]
set_drive 1  [get_ports {mem_rdata_I[33]}]
set_drive 1  [get_ports {mem_rdata_I[32]}]
set_drive 1  [get_ports {mem_rdata_I[31]}]
set_drive 1  [get_ports {mem_rdata_I[30]}]
set_drive 1  [get_ports {mem_rdata_I[29]}]
set_drive 1  [get_ports {mem_rdata_I[28]}]
set_drive 1  [get_ports {mem_rdata_I[27]}]
set_drive 1  [get_ports {mem_rdata_I[26]}]
set_drive 1  [get_ports {mem_rdata_I[25]}]
set_drive 1  [get_ports {mem_rdata_I[24]}]
set_drive 1  [get_ports {mem_rdata_I[23]}]
set_drive 1  [get_ports {mem_rdata_I[22]}]
set_drive 1  [get_ports {mem_rdata_I[21]}]
set_drive 1  [get_ports {mem_rdata_I[20]}]
set_drive 1  [get_ports {mem_rdata_I[19]}]
set_drive 1  [get_ports {mem_rdata_I[18]}]
set_drive 1  [get_ports {mem_rdata_I[17]}]
set_drive 1  [get_ports {mem_rdata_I[16]}]
set_drive 1  [get_ports {mem_rdata_I[15]}]
set_drive 1  [get_ports {mem_rdata_I[14]}]
set_drive 1  [get_ports {mem_rdata_I[13]}]
set_drive 1  [get_ports {mem_rdata_I[12]}]
set_drive 1  [get_ports {mem_rdata_I[11]}]
set_drive 1  [get_ports {mem_rdata_I[10]}]
set_drive 1  [get_ports {mem_rdata_I[9]}]
set_drive 1  [get_ports {mem_rdata_I[8]}]
set_drive 1  [get_ports {mem_rdata_I[7]}]
set_drive 1  [get_ports {mem_rdata_I[6]}]
set_drive 1  [get_ports {mem_rdata_I[5]}]
set_drive 1  [get_ports {mem_rdata_I[4]}]
set_drive 1  [get_ports {mem_rdata_I[3]}]
set_drive 1  [get_ports {mem_rdata_I[2]}]
set_drive 1  [get_ports {mem_rdata_I[1]}]
set_drive 1  [get_ports {mem_rdata_I[0]}]
set_drive 1  [get_ports mem_ready_I]
